# -*-   mode: tcl  ; coding: koi8   -*- ----------------------------------------

#!/bin/sh
# \
exec tclsh "$0" ${1+"$@"}
#
#-------------------------------------------------------------------------------
#
set auto_path [linsert $auto_path 0 "../common"]

package require compot::common 

#-------------------------------------------------------------------------------
# установить ссылку для конкретного окружения

#set_debian_OUT_add

puts ""

#-------------------------------------------------------------------------------

# ????? sometimes

# e_i__.jm TEST
# Segmentation fault
#
# mv E/OUT/e:e_i__.jm,TEST E/OUT/ERR

run_numer_tests  c . E/OUT 

puts ""

run_numer_tests  e . E/OUT 

puts ""

#-------------------------------------------------------------------------------


# run_numer_tests  f . E/OUT 

# puts ""

# run_numer_tests  g . E/OUT 

# puts ""


# run_numer_tests  m . E/OUT 

# puts ""

#-------------------------------------------------------------------------------
################################################################################

