
CHECK TEST_menu ... 

spawn a~.tl TEST_menu @
---------------------------------------------------
MENU (main) :
 
   r - RAND TEST
     - 
  st - SIMPLE TESTS ..
 
   q - ВОЗВРАТ/ВЫХОД
---------------------------------------------------
 
ВЫБЕРИТЕ КЛЮЧ и НАЖМИТЕ ENTER: s
 
---------------------------------------------------
MENU (main) :
 
   r - RAND TEST
     - 
  st - SIMPLE TESTS ..
 
   q - ВОЗВРАТ/ВЫХОД
---------------------------------------------------
 
ВЫБЕРИТЕ КЛЮЧ и НАЖМИТЕ ENTER: 3
 
---------------------------------------------------
MENU (main) :
 
   r - RAND TEST
     - 
  st - SIMPLE TESTS ..
 
   q - ВОЗВРАТ/ВЫХОД
---------------------------------------------------
 
ВЫБЕРИТЕ КЛЮЧ и НАЖМИТЕ ENTER: q
 
 

